# encoding: utf-8

AUTO_REPLAY = True

functions = '回复 #+功能名称 , 获得使用示例\n' \
            '如: #天气查询 \n' \
            '【绕 口 令】,【顺 口 溜】\n' \
            '【歇 后 语】,【租房信息】\n' \
            '【城市邮编】,【聊天对话】\n' \
            '【笑话大全】,【故事大全】\n' \
            '【成语接龙】,【吉凶查询】\n' \
            '【图片搜索】,【天气查询】\n' \
            '【菜谱大全】,【快递查询】\n' \
            '【数字计算】,【航班查询】\n' \
            '【列车查询】,【日期查询】\n' \
            '【问答百科】,【中英互译】\n' \
            '【附近餐厅】,【附近酒店】\n' \
            '【实时路况】,【新闻资讯】\n' \
            '【果蔬报价】,【汽油报价】\n' \
            '【影视搜索】,【股票查询】\n' \
            '【公交查询】,【路程报价】\n' \
            '【脑筋急转弯】\n' \
            '【星座运势生活百科】'

fun_array = {"绕口令": "讲个故事",
             "顺口溜": "说个顺口溜",
             "歇后语": "说个歇后语",
             "租房信息": "北京上地附近租房",
             "城市邮编": "北京的邮编",
             "聊天对话": "你好",
             "笑话大全": "讲个笑话",
             "故事大全": "讲个故事",
             "成语接龙": "成语接龙一诺千金",
             "吉凶查询": "周杰伦这个名字好不好",
             "图片搜索": "周杰伦的图片",
             "天气查询": "北京天气",
             "菜谱大全": "鱼香肉丝怎么做",
             "快递查询": "查询快递123456789",
             "数字计算": "3乘以3是多少",
             "航班查询": "今天北京到上海的飞机",
             "列车查询": "今天北京到上海的火车",
             "日期查询": "今天农历多少",
             "问答百科": "天为什么是蓝的",
             "中英互译": "苹果的单词是什么",
             "附近餐厅": "北京三里屯附近的餐厅",
             "附近酒店": "上地信息路堵吗",
             "实时路况": "北京上地信息路堵吗",
             "新闻资讯": "今日新闻",
             "果蔬报价": "海南芒果的价格",
             "汽油报价": "北京汽油的价格",
             "影视搜索": "最近热门电影",
             "股票查询": "腾讯股票",
             "公交查询": "北京市天安门到王府井的公交有哪些",
             "路程报价": "北京市从清华大学东门到天安门多少钱",
             "脑筋急转弯": "说个脑筋急转弯",
             "星座运势": "双子座的运势",
             "生活百科": "周杰伦的简介"
             }


def get_example(fuc):
    order = "请输入正确的指令"
    exp = fun_array.get(fuc.strip(), order)
    return "小K:" + (("您可以输入类似命令: " + exp, exp)[exp == order])


def get_functions():
    return functions
